Revit 2027 API
ICustomFieldProperties.AreEqualTo Method
 Identifies if the custom field properties are equal or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool AreEqualTo(
	ICustomFieldProperties otherProperties
)
Function AreEqualTo (
	otherProperties As ICustomFieldProperties
) As Boolean
bool AreEqualTo(
	ICustomFieldProperties^ otherProperties
)
abstract AreEqualTo :
        otherProperties : ICustomFieldProperties -> bool
Parameters
otherProperties ICustomFieldProperties
 The other properties.
Return Value
Boolean
 Returns true if the custom field properties are equal, false otherwise.
See Also
Reference
ICustomFieldProperties Interface
Autodesk.Revit.DB Namespace